*** crates/online-core/src/clock.rs:115:42: replace - with + in ClockState::advance

*** mutation diff:
--- crates/online-core/src/clock.rs
+++ replace - with + in ClockState::advance
@@ -107,17 +107,17 @@
     pub fn advance(
         &mut self,
         cfg: &ClockCfg,
         clock: Option<f64>,
         session: Option<u64>,
         accept: bool,
     ) -> ClockAdvance {
         let raw = match (clock, self.prev_clock) {
-            (Some(c), Some(p)) => Some(c - p),
+            (Some(c), Some(p)) => Some(c + /* ~ changed by cargo-mutants ~ */ p),
             (Some(_), None) => None, // first row of the stream
             (None, _) => {
                 if self.started {
                     Some(1.0)
                 } else {
                     None
                 }
             }

---- clock::tests::skipped_rows_fold_into_pending stdout ----

thread 'clock::tests::skipped_rows_fold_into_pending' (5761148) panicked at crates/online-core/src/clock.rs:270:9:
assertion `left == right` failed
  left: 11.0
 right: 5.0

---- clock::tests::caps_and_negative_deltas stdout ----

thread 'clock::tests::caps_and_negative_deltas' (5761144) panicked at crates/online-core/src/clock.rs:215:9:
assertion `left == right` failed
  left: [0.0, 10.0, 15.0, 11.0, 50.0]
 right: [0.0, 10.0, 50.0, 1.0, 50.0]

failures:
    clock::tests::caps_and_negative_deltas
    clock::tests::skipped_rows_fold_into_pending

test result: FAILED. 46 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.18s

*** result: Failure(101)
