*** crates/online-core/src/clock.rs:126:37: replace != with == in ClockState::advance

*** mutation diff:
--- crates/online-core/src/clock.rs
+++ replace != with == in ClockState::advance
@@ -118,17 +118,17 @@
                 if self.started {
                     Some(1.0)
                 } else {
                     None
                 }
             }
         };
         let session_changed = match (session, self.prev_session) {
-            (Some(s), Some(p)) => s != p,
+            (Some(s), Some(p)) => s == /* ~ changed by cargo-mutants ~ */ p,
             _ => false,
         };
 
         let mut reset = false;
         let mut d = match raw {
             None => 0.0,
             Some(raw) => {
                 if session_changed {

---- clock::tests::session_gap_overrides_delta stdout ----

thread 'clock::tests::session_gap_overrides_delta' (5785025) panicked at crates/online-core/src/clock.rs:276:9:
assertion `left == right` failed
  left: 50.0
 right: 7.5

failures:
    clock::tests::session_gap_overrides_delta

test result: FAILED. 48 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.24s

*** result: Failure(101)
