*** crates/online-core/src/clock.rs:143:31: replace < with == in ClockState::advance

*** mutation diff:
--- crates/online-core/src/clock.rs
+++ replace < with == in ClockState::advance
@@ -135,17 +135,17 @@
                     match cfg.session_gap {
                         Some(SessionGap::Reset) => {
                             reset = true;
                             0.0
                         }
                         Some(SessionGap::Gap(g)) => g.clamp(0.0, cfg.max_dclock),
                         None => raw.clamp(0.0, cfg.max_dclock),
                     }
-                } else if raw < 0.0 {
+                } else if raw == /* ~ changed by cargo-mutants ~ */ 0.0 {
                     match cfg.on_clock_reset {
                         OnClockReset::Max => cfg.max_dclock,
                         OnClockReset::Zero => 0.0,
                         OnClockReset::ResetState => {
                             reset = true;
                             0.0
                         }
                     }

---- clock::tests::caps_and_negative_deltas stdout ----

thread 'clock::tests::caps_and_negative_deltas' (5766451) panicked at crates/online-core/src/clock.rs:215:9:
assertion `left == right` failed
  left: [0.0, 10.0, -5.0, 1.0, 50.0]
 right: [0.0, 10.0, 50.0, 1.0, 50.0]

failures:
    clock::tests::caps_and_negative_deltas

test result: FAILED. 47 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.20s

*** result: Failure(101)
