*** crates/online-core/src/clock.rs:175:26: replace += with *= in ClockState::advance

*** mutation diff:
--- crates/online-core/src/clock.rs
+++ replace += with *= in ClockState::advance
@@ -167,17 +167,17 @@
             let total = self.pending + d;
             self.pending = 0.0;
             ClockAdvance {
                 d_clock: total,
                 reset,
                 accepted: true,
             }
         } else {
-            self.pending += d;
+            self.pending *= /* ~ changed by cargo-mutants ~ */ d;
             ClockAdvance {
                 d_clock: 0.0,
                 reset,
                 accepted: false,
             }
         }
     }
 }

---- clock::tests::skipped_rows_fold_into_pending stdout ----

thread 'clock::tests::skipped_rows_fold_into_pending' (5789584) panicked at crates/online-core/src/clock.rs:297:9:
assertion `left == right` failed
  left: 2.0
 right: 5.0

failures:
    clock::tests::skipped_rows_fold_into_pending

test result: FAILED. 48 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.18s

*** result: Failure(101)
