*** crates/online-core/src/clock.rs:21:9: replace Decay::factor -> f64 with 0.0

*** mutation diff:
--- crates/online-core/src/clock.rs
+++ replace Decay::factor -> f64 with 0.0
@@ -13,26 +13,17 @@
     /// `factor = 0.5^(d_clock / halflife)`
     Halflife(f64),
     /// `factor = lam^d_clock` (with a row-count clock, `lam` per row).
     Lam(f64),
 }
 
 impl Decay {
     pub fn factor(&self, d_clock: f64) -> f64 {
-        match *self {
-            Decay::Halflife(h) => {
-                if h.is_infinite() {
-                    1.0
-                } else {
-                    0.5f64.powf(d_clock / h)
-                }
-            }
-            Decay::Lam(l) => l.powf(d_clock),
-        }
+        0.0 /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// What to do when the raw clock delta is negative (docs/PLAN.md §3).
 #[derive(Debug, Clone, Copy, PartialEq, Eq, Default, Serialize, Deserialize)]
 #[serde(rename_all = "snake_case")]
 pub enum OnClockReset {
     /// Treat the delta as `max_dclock` (default).

---- clock::tests::decay_factors stdout ----

thread 'clock::tests::decay_factors' (5756996) panicked at crates/online-core/src/clock.rs:266:9:
assertion failed: (Decay::Halflife(10.0).factor(10.0) - 0.5).abs() < 1e-15

---- ewridge::tests::zero_variance_feature_dropped_in_standardized_solve stdout ----

thread 'ewridge::tests::zero_variance_feature_dropped_in_standardized_solve' (5757011) panicked at crates/online-core/src/ewridge.rs:654:17:
row 11

---- ftrl::tests::state_roundtrip stdout ----

thread 'ftrl::tests::state_roundtrip' (5757024) panicked at crates/online-core/src/ftrl.rs:387:13:
assertion `left == right` failed
  left: [NaN]
 right: [NaN]

failures:
    clock::tests::decay_factors
    ewridge::tests::multi_target_and_grids
    ewridge::tests::null_target_is_predict_only
    ewridge::tests::pred_is_out_of_sample_and_warmup_nan
    ewridge::tests::recovers_static_beta
    ewridge::tests::state_roundtrip_continues_identically
    ewridge::tests::zero_variance_feature_dropped_in_standardized_solve
    ftrl::tests::base_rate_is_learned_by_the_intercept
    ftrl::tests::forgets_on_the_clock
    ftrl::tests::l1_shrinks_noise_features_and_can_zero_everything
    ftrl::tests::learns_a_separable_rule
    ftrl::tests::state_roundtrip

test result: FAILED. 23 passed; 25 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.17s

*** result: Failure(101)
