*** crates/online-core/src/clock.rs:26:41: replace / with % in Decay::factor

*** mutation diff:
--- crates/online-core/src/clock.rs
+++ replace / with % in Decay::factor
@@ -18,17 +18,17 @@
 
 impl Decay {
     pub fn factor(&self, d_clock: f64) -> f64 {
         match *self {
             Decay::Halflife(h) => {
                 if h.is_infinite() {
                     1.0
                 } else {
-                    0.5f64.powf(d_clock / h)
+                    0.5f64.powf(d_clock % /* ~ changed by cargo-mutants ~ */ h)
                 }
             }
             Decay::Lam(l) => l.powf(d_clock),
         }
     }
 }
 
 /// What to do when the raw clock delta is negative (docs/PLAN.md §3).

---- clock::tests::decay_factors stdout ----

thread 'clock::tests::decay_factors' (5771701) panicked at crates/online-core/src/clock.rs:275:9:
assertion failed: (Decay::Halflife(10.0).factor(10.0) - 0.5).abs() < 1e-15

---- kalman::tests::null_target_is_predict_only stdout ----

thread 'kalman::tests::null_target_is_predict_only' (5771739) panicked at crates/online-core/src/kalman.rs:544:9:
assertion failed: st.pred[1].is_finite()

---- kalman::tests::state_roundtrip stdout ----

thread 'kalman::tests::state_roundtrip' (5771741) panicked at crates/online-core/src/kalman.rs:522:13:
assertion `left == right` failed
  left: [NaN]
 right: [NaN]

failures:
    clock::tests::decay_factors
    ftrl::tests::forgets_on_the_clock
    kalman::tests::null_target_is_predict_only
    kalman::tests::state_roundtrip
    kalman::tests::tracks_a_drifting_beta_better_than_a_pinned_one
    kalman::tests::tracks_a_static_beta
    rls::tests::agrees_with_ewridge_solved_every_row

test result: FAILED. 41 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.18s

*** result: Failure(101)
