*** crates/online-core/src/clock.rs:128:42: replace - with / in ClockState::advance

*** mutation diff:
--- crates/online-core/src/clock.rs
+++ replace - with / in ClockState::advance
@@ -120,17 +120,17 @@
     pub fn advance(
         &mut self,
         cfg: &ClockCfg,
         clock: Option<f64>,
         session: Option<u64>,
         accept: bool,
     ) -> ClockAdvance {
         let raw = match (clock, self.prev_clock) {
-            (Some(c), Some(p)) => Some(c - p),
+            (Some(c), Some(p)) => Some(c / /* ~ changed by cargo-mutants ~ */ p),
             (Some(_), None) => None, // first row of the stream
             (None, _) => {
                 if self.started {
                     Some(1.0)
                 } else {
                     None
                 }
             }

---- clock::tests::duplicate_clock_values_are_zero_deltas stdout ----

thread 'clock::tests::duplicate_clock_values_are_zero_deltas' (7514960) panicked at crates/online-core/src/clock.rs:279:13:
assertion `left == right` failed: Max: repeated clock must give delta 0
  left: 1.0
 right: 0.0

---- clock::tests::skipped_rows_fold_into_pending stdout ----

thread 'clock::tests::skipped_rows_fold_into_pending' (7514965) panicked at crates/online-core/src/clock.rs:363:9:
assertion `left == right` failed
  left: inf
 right: 5.0

---- clock::tests::caps_and_negative_deltas stdout ----

thread 'clock::tests::caps_and_negative_deltas' (7514958) panicked at crates/online-core/src/clock.rs:237:9:
assertion `left == right` failed
  left: [0.0, 50.0, 0.5, 1.2, 33.333333333333336]
 right: [0.0, 10.0, 50.0, 1.0, 50.0]

failures:
    clock::tests::caps_and_negative_deltas
    clock::tests::duplicate_clock_values_are_zero_deltas
    clock::tests::error_policy_reports_a_backwards_clock
    clock::tests::skipped_rows_fold_into_pending

test result: FAILED. 121 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.32s

*** result: Failure(101)
