*** crates/online-core/src/clock.rs:139:13: delete match arm (Some(s), Some(p)) in ClockState::advance

*** mutation diff:
--- crates/online-core/src/clock.rs
+++ delete match arm (Some(s), Some(p)) in ClockState::advance
@@ -131,17 +131,17 @@
                 if self.started {
                     Some(1.0)
                 } else {
                     None
                 }
             }
         };
         let session_changed = match (session, self.prev_session) {
-            (Some(s), Some(p)) => s != p,
+             /* ~ changed by cargo-mutants ~ */
             _ => false,
         };
 
         let mut reset = false;
         let mut backwards = None;
         let mut d = match raw {
             None => 0.0,
             Some(raw) => {

---- clock::tests::session_change_is_reported_separately_from_reset stdout ----

thread 'clock::tests::session_change_is_reported_separately_from_reset' (7516329) panicked at crates/online-core/src/clock.rs:326:9:
a new session id should be reported

---- clock::tests::session_gap_overrides_delta stdout ----

thread 'clock::tests::session_gap_overrides_delta' (7516330) panicked at crates/online-core/src/clock.rs:342:9:
assertion `left == right` failed
  left: 50.0
 right: 7.5

failures:
    clock::tests::session_change_is_reported_separately_from_reset
    clock::tests::session_gap_overrides_delta

test result: FAILED. 123 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.96s

*** result: Failure(101)
