*** crates/online-core/src/clock.rs:143:31: replace < with > in ClockState::advance

*** mutation diff:
--- crates/online-core/src/clock.rs
+++ replace < with > in ClockState::advance
@@ -135,17 +135,17 @@
                     match cfg.session_gap {
                         Some(SessionGap::Reset) => {
                             reset = true;
                             0.0
                         }
                         Some(SessionGap::Gap(g)) => g.clamp(0.0, cfg.max_dclock),
                         None => raw.clamp(0.0, cfg.max_dclock),
                     }
-                } else if raw < 0.0 {
+                } else if raw > /* ~ changed by cargo-mutants ~ */ 0.0 {
                     match cfg.on_clock_reset {
                         OnClockReset::Max => cfg.max_dclock,
                         OnClockReset::Zero => 0.0,
                         OnClockReset::ResetState => {
                             reset = true;
                             0.0
                         }
                     }

---- clock::tests::duplicate_clock_values_are_zero_deltas stdout ----

thread 'clock::tests::duplicate_clock_values_are_zero_deltas' (5786889) panicked at crates/online-core/src/clock.rs:257:38:
assertion `left == right` failed
  left: -1.0
 right: 10.0

---- clock::tests::skipped_rows_fold_into_pending stdout ----

thread 'clock::tests::skipped_rows_fold_into_pending' (5786892) panicked at crates/online-core/src/clock.rs:297:9:
assertion `left == right` failed
  left: inf
 right: 5.0

---- clock::tests::caps_and_negative_deltas stdout ----

thread 'clock::tests::caps_and_negative_deltas' (5786887) panicked at crates/online-core/src/clock.rs:215:9:
assertion `left == right` failed
  left: [0.0, 50.0, -5.0, 50.0, 50.0]
 right: [0.0, 10.0, 50.0, 1.0, 50.0]

failures:
    clock::tests::caps_and_negative_deltas
    clock::tests::duplicate_clock_values_are_zero_deltas
    clock::tests::row_count_clock
    clock::tests::skipped_rows_fold_into_pending

test result: FAILED. 45 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.18s

*** result: Failure(101)
