*** crates/online-core/src/clock.rs:157:31: replace < with <= in ClockState::advance

*** mutation diff:
--- crates/online-core/src/clock.rs
+++ replace < with <= in ClockState::advance
@@ -149,17 +149,17 @@
                     match cfg.session_gap {
                         Some(SessionGap::Reset) => {
                             reset = true;
                             0.0
                         }
                         Some(SessionGap::Gap(g)) => g.clamp(0.0, cfg.max_dclock),
                         None => raw.clamp(0.0, cfg.max_dclock),
                     }
-                } else if raw < 0.0 {
+                } else if raw <= /* ~ changed by cargo-mutants ~ */ 0.0 {
                     match cfg.on_clock_reset {
                         OnClockReset::Max => cfg.max_dclock,
                         OnClockReset::Zero => 0.0,
                         OnClockReset::ResetState => {
                             reset = true;
                             0.0
                         }
                         OnClockReset::Error => {

---- clock::tests::error_policy_reports_a_backwards_clock stdout ----

thread 'clock::tests::error_policy_reports_a_backwards_clock' (7519236) panicked at crates/online-core/src/clock.rs:309:9:
assertion failed: c.advance(&cfg, Some(10.0), None, true).backwards.is_none()

---- clock::tests::duplicate_clock_values_are_zero_deltas stdout ----

thread 'clock::tests::duplicate_clock_values_are_zero_deltas' (7519235) panicked at crates/online-core/src/clock.rs:279:13:
assertion `left == right` failed: Max: repeated clock must give delta 0
  left: 10.0
 right: 0.0

failures:
    clock::tests::duplicate_clock_values_are_zero_deltas
    clock::tests::error_policy_reports_a_backwards_clock

test result: FAILED. 123 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.72s

*** result: Failure(101)
