*** crates/online-core/src/clock.rs:185:38: replace + with - in ClockState::advance

*** mutation diff:
--- crates/online-core/src/clock.rs
+++ replace + with - in ClockState::advance
@@ -177,17 +177,17 @@
             self.pending = 0.0;
             d = 0.0;
         }
         self.prev_clock = clock;
         self.prev_session = session;
         self.started = true;
 
         if accept {
-            let total = self.pending + d;
+            let total = self.pending - /* ~ changed by cargo-mutants ~ */ d;
             self.pending = 0.0;
             ClockAdvance {
                 d_clock: total,
                 reset,
                 accepted: true,
                 backwards,
                 session_changed,
             }

---- clock::tests::skipped_rows_fold_into_pending stdout ----

thread 'clock::tests::skipped_rows_fold_into_pending' (7520200) panicked at crates/online-core/src/clock.rs:363:9:
assertion `left == right` failed
  left: 1.0
 right: 5.0

---- clock::tests::session_gap_overrides_delta stdout ----

thread 'clock::tests::session_gap_overrides_delta' (7520199) panicked at crates/online-core/src/clock.rs:342:9:
assertion `left == right` failed
  left: -7.5
 right: 7.5

---- clock::tests::caps_and_negative_deltas stdout ----

thread 'clock::tests::caps_and_negative_deltas' (7520193) panicked at crates/online-core/src/clock.rs:237:9:
assertion `left == right` failed
  left: [0.0, -10.0, -50.0, -1.0, -50.0]
 right: [0.0, 10.0, 50.0, 1.0, 50.0]

failures:
    clock::tests::caps_and_negative_deltas
    clock::tests::duplicate_clock_values_are_zero_deltas
    clock::tests::row_count_clock
    clock::tests::session_gap_overrides_delta
    clock::tests::skipped_rows_fold_into_pending

test result: FAILED. 120 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.77s

*** result: Failure(101)
