*** crates/online-core/src/clock.rs:21:9: replace Decay::factor -> f64 with 1.0

*** mutation diff:
--- crates/online-core/src/clock.rs
+++ replace Decay::factor -> f64 with 1.0
@@ -13,26 +13,17 @@
     /// `factor = 0.5^(d_clock / halflife)`
     Halflife(f64),
     /// `factor = lam^d_clock` (with a row-count clock, `lam` per row).
     Lam(f64),
 }
 
 impl Decay {
     pub fn factor(&self, d_clock: f64) -> f64 {
-        match *self {
-            Decay::Halflife(h) => {
-                if h.is_infinite() {
-                    1.0
-                } else {
-                    0.5f64.powf(d_clock / h)
-                }
-            }
-            Decay::Lam(l) => l.powf(d_clock),
-        }
+        1.0 /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// What to do when the raw clock delta is negative (docs/PLAN.md §3).
 #[derive(Debug, Clone, Copy, PartialEq, Eq, Default, Serialize, Deserialize)]
 #[serde(rename_all = "snake_case")]
 pub enum OnClockReset {
     /// Treat the delta as `max_dclock` (default).

---- clock::tests::decay_factors stdout ----

thread 'clock::tests::decay_factors' (5790173) panicked at crates/online-core/src/clock.rs:293:9:
assertion failed: (Decay::Halflife(10.0).factor(10.0) - 0.5).abs() < 1e-15

failures:
    clock::tests::decay_factors

test result: FAILED. 48 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.17s

*** result: Failure(101)
