*** crates/online-core/src/clock.rs:26:41: replace / with * in Decay::factor

*** mutation diff:
--- crates/online-core/src/clock.rs
+++ replace / with * in Decay::factor
@@ -18,17 +18,17 @@
 
 impl Decay {
     pub fn factor(&self, d_clock: f64) -> f64 {
         match *self {
             Decay::Halflife(h) => {
                 if h.is_infinite() {
                     1.0
                 } else {
-                    0.5f64.powf(d_clock / h)
+                    0.5f64.powf(d_clock * /* ~ changed by cargo-mutants ~ */ h)
                 }
             }
             Decay::Lam(l) => l.powf(d_clock),
         }
     }
 }
 
 /// What to do when the raw clock delta is negative (docs/PLAN.md §3).

---- clock::tests::decay_factors stdout ----

thread 'clock::tests::decay_factors' (7509767) panicked at crates/online-core/src/clock.rs:368:9:
assertion failed: (Decay::Halflife(10.0).factor(10.0) - 0.5).abs() < 1e-15

---- ftrl::tests::forgets_on_the_clock stdout ----

thread 'ftrl::tests::forgets_on_the_clock' (7509824) panicked at crates/online-core/src/ftrl.rs:461:9:
after the flip p(x=0.9) should be low, got NaN

---- kalman::tests::predictive_variance_exceeds_the_observation_noise stdout ----

thread 'kalman::tests::predictive_variance_exceeds_the_observation_noise' (7509844) panicked at crates/online-core/src/kalman.rs:657:13:
assertion failed: m.pred_var()[0] >= 0.25 - 1e-12

failures:
    clock::tests::decay_factors
    ewridge::tests::session_shrink_reverts_toward_the_long_run
    ftrl::tests::forgets_on_the_clock
    kalman::tests::null_target_is_predict_only
    kalman::tests::predictive_variance_exceeds_the_observation_noise
    kalman::tests::predictive_variance_narrows_with_evidence
    kalman::tests::state_roundtrip
    kalman::tests::tracks_a_drifting_beta_better_than_a_pinned_one
    kalman::tests::tracks_a_static_beta
    rls::tests::agrees_with_ewridge_solved_every_row
    rls::tests::state_roundtrip

test result: FAILED. 114 passed; 11 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.94s

*** result: Failure(101)
