*** crates/online-core/src/drift.rs:51:9: replace PageHinkley::n -> f64 with 0.0

*** mutation diff:
--- crates/online-core/src/drift.rs
+++ replace PageHinkley::n -> f64 with 0.0
@@ -43,17 +43,17 @@
             mean: 0.0,
             cum: 0.0,
             min_cum: 0.0,
         }
     }
 
     /// Observations seen since the last reset.
     pub fn n(&self) -> f64 {
-        self.n
+        0.0 /* ~ changed by cargo-mutants ~ */
     }
 
     /// How far the accumulated excess is above its low-water mark.
     pub fn statistic(&self) -> f64 {
         self.cum - self.min_cum
     }
 
     /// Feed one error value. Returns true when drift is detected, and clears

*** result: Success
