*** crates/online-core/src/drift.rs:51:9: replace PageHinkley::n -> f64 with -1.0

*** mutation diff:
--- crates/online-core/src/drift.rs
+++ replace PageHinkley::n -> f64 with -1.0
@@ -43,17 +43,17 @@
             mean: 0.0,
             cum: 0.0,
             min_cum: 0.0,
         }
     }
 
     /// Observations seen since the last reset.
     pub fn n(&self) -> f64 {
-        self.n
+        -1.0 /* ~ changed by cargo-mutants ~ */
     }
 
     /// How far the accumulated excess is above its low-water mark.
     pub fn statistic(&self) -> f64 {
         self.cum - self.min_cum
     }
 
     /// Feed one error value. Returns true when drift is detected, and clears

---- drift::tests::resets_after_detecting stdout ----

thread 'drift::tests::resets_after_detecting' (7526822) panicked at crates/online-core/src/drift.rs:133:9:
assertion `left == right` failed: state should clear on detection
  left: -1.0
 right: 0.0

---- drift::tests::non_finite_values_are_ignored stdout ----

thread 'drift::tests::non_finite_values_are_ignored' (7526820) panicked at crates/online-core/src/drift.rs:166:9:
assertion `left == right` failed
  left: -1.0
 right: 0.0

failures:
    drift::tests::non_finite_values_are_ignored
    drift::tests::resets_after_detecting

test result: FAILED. 123 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.86s

*** result: Failure(101)
