*** crates/online-core/src/drift.rs:56:18: replace - with + in PageHinkley::statistic

*** mutation diff:
--- crates/online-core/src/drift.rs
+++ replace - with + in PageHinkley::statistic
@@ -48,17 +48,17 @@
 
     /// Observations seen since the last reset.
     pub fn n(&self) -> f64 {
         self.n
     }
 
     /// How far the accumulated excess is above its low-water mark.
     pub fn statistic(&self) -> f64 {
-        self.cum - self.min_cum
+        self.cum + /* ~ changed by cargo-mutants ~ */ self.min_cum
     }
 
     /// Feed one error value. Returns true when drift is detected, and clears
     /// the state so detection restarts from the new regime.
     pub fn update(&mut self, e: f64) -> bool {
         if !e.is_finite() {
             return false;
         }

*** result: Success
