*** crates/online-core/src/drift.rs:62:12: delete ! in PageHinkley::update

*** mutation diff:
--- crates/online-core/src/drift.rs
+++ delete ! in PageHinkley::update
@@ -54,17 +54,17 @@
     /// How far the accumulated excess is above its low-water mark.
     pub fn statistic(&self) -> f64 {
         self.cum - self.min_cum
     }
 
     /// Feed one error value. Returns true when drift is detected, and clears
     /// the state so detection restarts from the new regime.
     pub fn update(&mut self, e: f64) -> bool {
-        if !e.is_finite() {
+        if  /* ~ changed by cargo-mutants ~ */e.is_finite() {
             return false;
         }
         self.n += 1.0;
         self.mean += (e - self.mean) / self.n;
         self.cum += e - self.mean - self.delta;
         if self.cum < self.min_cum {
             self.min_cum = self.cum;
         }

*** result: Timeout
