*** crates/online-core/src/drift.rs:62:9: replace PageHinkley::update -> bool with true

*** mutation diff:
--- crates/online-core/src/drift.rs
+++ replace PageHinkley::update -> bool with true
@@ -54,31 +54,17 @@
     /// How far the accumulated excess is above its low-water mark.
     pub fn statistic(&self) -> f64 {
         self.cum - self.min_cum
     }
 
     /// Feed one error value. Returns true when drift is detected, and clears
     /// the state so detection restarts from the new regime.
     pub fn update(&mut self, e: f64) -> bool {
-        if !e.is_finite() {
-            return false;
-        }
-        self.n += 1.0;
-        self.mean += (e - self.mean) / self.n;
-        self.cum += e - self.mean - self.delta;
-        if self.cum < self.min_cum {
-            self.min_cum = self.cum;
-        }
-        if self.statistic() > self.threshold {
-            self.reset();
-            true
-        } else {
-            false
-        }
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn reset(&mut self) {
         self.n = 0.0;
         self.mean = 0.0;
         self.cum = 0.0;
         self.min_cum = 0.0;
     }

---- drift::tests::a_bigger_threshold_is_slower stdout ----

thread 'drift::tests::a_bigger_threshold_is_slower' (7532800) panicked at crates/online-core/src/drift.rs:132:9:
assertion failed: time_to_detect(50.0) > time_to_detect(5.0)

---- drift::tests::non_finite_values_are_ignored stdout ----

thread 'drift::tests::non_finite_values_are_ignored' (7532803) panicked at crates/online-core/src/drift.rs:150:9:
assertion failed: !ph.update(f64::NAN)

---- drift::tests::quiet_stream_does_not_drift stdout ----

thread 'drift::tests::quiet_stream_does_not_drift' (7532804) panicked at crates/online-core/src/drift.rs:90:13:
false positive on a stationary stream

failures:
    drift::tests::a_bigger_threshold_is_slower
    drift::tests::delta_absorbs_small_shifts
    drift::tests::non_finite_values_are_ignored
    drift::tests::quiet_stream_does_not_drift

test result: FAILED. 121 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.79s

*** result: Failure(101)
