*** crates/online-core/src/drift.rs:62:9: replace PageHinkley::update -> bool with false

*** mutation diff:
--- crates/online-core/src/drift.rs
+++ replace PageHinkley::update -> bool with false
@@ -54,31 +54,17 @@
     /// How far the accumulated excess is above its low-water mark.
     pub fn statistic(&self) -> f64 {
         self.cum - self.min_cum
     }
 
     /// Feed one error value. Returns true when drift is detected, and clears
     /// the state so detection restarts from the new regime.
     pub fn update(&mut self, e: f64) -> bool {
-        if !e.is_finite() {
-            return false;
-        }
-        self.n += 1.0;
-        self.mean += (e - self.mean) / self.n;
-        self.cum += e - self.mean - self.delta;
-        if self.cum < self.min_cum {
-            self.min_cum = self.cum;
-        }
-        if self.statistic() > self.threshold {
-            self.reset();
-            true
-        } else {
-            false
-        }
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn reset(&mut self) {
         self.n = 0.0;
         self.mean = 0.0;
         self.cum = 0.0;
         self.min_cum = 0.0;
     }

*** result: Timeout
