*** crates/online-core/src/drift.rs:65:16: replace += with -= in PageHinkley::update

*** mutation diff:
--- crates/online-core/src/drift.rs
+++ replace += with -= in PageHinkley::update
@@ -57,17 +57,17 @@
     }
 
     /// Feed one error value. Returns true when drift is detected, and clears
     /// the state so detection restarts from the new regime.
     pub fn update(&mut self, e: f64) -> bool {
         if !e.is_finite() {
             return false;
         }
-        self.n += 1.0;
+        self.n -= /* ~ changed by cargo-mutants ~ */ 1.0;
         self.mean += (e - self.mean) / self.n;
         self.cum += e - self.mean - self.delta;
         if self.cum < self.min_cum {
             self.min_cum = self.cum;
         }
         if self.statistic() > self.threshold {
             self.reset();
             true

---- drift::tests::quiet_stream_does_not_drift stdout ----

thread 'drift::tests::quiet_stream_does_not_drift' (7534919) panicked at crates/online-core/src/drift.rs:104:13:
false positive on a stationary stream

---- drift::tests::delta_absorbs_small_shifts stdout ----

thread 'drift::tests::delta_absorbs_small_shifts' (7534916) panicked at crates/online-core/src/drift.rs:157:13:
a shift below delta should be absorbed

failures:
    drift::tests::delta_absorbs_small_shifts
    drift::tests::quiet_stream_does_not_drift

test result: FAILED. 123 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.73s

*** result: Failure(101)
