*** crates/online-core/src/drift.rs:67:18: replace += with -= in PageHinkley::update

*** mutation diff:
--- crates/online-core/src/drift.rs
+++ replace += with -= in PageHinkley::update
@@ -59,17 +59,17 @@
     /// Feed one error value. Returns true when drift is detected, and clears
     /// the state so detection restarts from the new regime.
     pub fn update(&mut self, e: f64) -> bool {
         if !e.is_finite() {
             return false;
         }
         self.n += 1.0;
         self.mean += (e - self.mean) / self.n;
-        self.cum += e - self.mean - self.delta;
+        self.cum -= /* ~ changed by cargo-mutants ~ */ e - self.mean - self.delta;
         if self.cum < self.min_cum {
             self.min_cum = self.cum;
         }
         if self.statistic() > self.threshold {
             self.reset();
             true
         } else {
             false

---- drift::tests::delta_absorbs_small_shifts stdout ----

thread 'drift::tests::delta_absorbs_small_shifts' (7541004) panicked at crates/online-core/src/drift.rs:157:13:
a shift below delta should be absorbed

---- drift::tests::a_bigger_threshold_is_slower stdout ----

thread 'drift::tests::a_bigger_threshold_is_slower' (7541003) panicked at crates/online-core/src/drift.rs:144:53:
called `Option::unwrap()` on a `None` value

---- drift::tests::quiet_stream_does_not_drift stdout ----

thread 'drift::tests::quiet_stream_does_not_drift' (7541007) panicked at crates/online-core/src/drift.rs:104:13:
false positive on a stationary stream

failures:
    drift::tests::a_bigger_threshold_is_slower
    drift::tests::delta_absorbs_small_shifts
    drift::tests::detects_a_step_change_in_error
    drift::tests::quiet_stream_does_not_drift

test result: FAILED. 121 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.73s

*** result: Failure(101)
